[
  {
    "soru": "Diyabet hastasıyım ve kilo vermek istiyorum. Beslenmemde günlük kalori alımımı ne kadar azaltmalıyım?",
    "cevap": "Optimal kilonun üzerindeki fazla kilolu veya obez hastalarda, kilo kaybı sağlamada günde 500-1.000 kcal enerji kısıtlaması hedeflenebilir."
  },
  {
    "soru": "Tip 2 diyabetim var ve obezitem de bulunuyor. Ne kadar kilo kaybı hedeflenmeli?",
    "cevap": "Fazla kilolu ve obez bireylerde, başlangıçta beslenme, fiziksel aktivite ve davranış değişiklikleri ile en az %3-7'lik bir kilo kaybı hedeflenir. Kan basıncı, lipidler ve glisemik kontrol için ise %5'in üzerinde, hatta %10'a varan bir kilo kaybı hedeflenmelidir."
  },
  {
    "soru": "Diyabetli bir birey için günlük protein alımı ne kadar olmalı?",
    "cevap": "Günlük protein alımının genel öneriler olan 0,8-1,5 g/kg/gün dışında olmasının olumlu etkilerine dair kanıt bulunmamaktadır. Ancak diyabeti ve kronik böbrek hastalığı olan hastalarda protein alımı kısıtlanmalıdır (0,8-1 g/kg/gün)."
  },
  {
    "soru": "Diyabet hastasıyım, diyette doymuş yağ alımımı ne kadarla sınırlamalıyım?",
    "cevap": "Diyabeti olan bireylerde doymuş yağ alımı, günlük toplam enerji ihtiyacının %7'sini aşmamalıdır."
  },
  {
    "soru": "Diyabette hangi beslenme modelleri öneriliyor?",
    "cevap": "Özellikle Akdeniz beslenme modeli ve DASH beslenme modelinin olumlu metabolik etkilerinin olduğu bildirilmekte ve önerilmektedir. Ancak beslenme tedavisi kanıta dayalı beslenme modelleri önerilerine göre bireye özgüdür."
  },
  {
    "soru": "Diyabetliyim, haftada ne kadar egzersiz yapmam önerilir?",
    "cevap": "Diyabeti olan bireylerde, haftada en az 150 dakika orta düzeyde egzersizin, direnç egzersizi (haftada 2-3 kere) ile kombine olarak yapılması önerilmektedir."
  },
  {
    "soru": "Egzersiz öncesi kalp muayenesi yaptırmalı mıyım?",
    "cevap": "Yüksek kardiyovasküler riske sahip hastalarda egzersiz öncesi ayrıntılı kardiyak muayene yapılmalıdır."
  },
  {
    "soru": "Yüksek riskli bir hasta olarak egzersize nasıl başlamalıyım?",
    "cevap": "Yüksek kardiyovasküler riske sahip hastalarda, kısa süreli düşük yoğunluklu egzersiz ile başlanıp, tolere edildikçe süre ve yoğunluğun yavaş yavaş artırılması önerilmektedir."
  },
  {
    "soru": "Egzersiz öncesi hangi muayeneleri yaptırmalıyım?",
    "cevap": "Egzersiz öncesi hastalara fundoskopik muayene, diyabetik ayak muayenesi ve nörolojik muayene de yapılmalıdır."
  },
  {
    "soru": "Hangi durumlarda aktif egzersiz yapmam sakıncalıdır?",
    "cevap": "Tedavisiz proliferatif retinopatisi olan, ayak ülserleri olan, otonom nöropati, ortostatik hipotansiyonu olan, kontrolsüz hipertansiyonu, ketonemisi olan, hipoglisemi veya hiperglisemisi (>250 mg/dl) olan hastalarda aktif egzersiz uygun olmayacaktır."
  },
  {
    "soru": "Prediyabet teşhisi kondu. Diyabeti önlemek için ne gibi yaşam tarzı değişiklikleri yapmalıyım?",
    "cevap": "Kilo fazlalığı veya obezitesi olan erişkinler yaşam tarzı değişikliği ile ilk 6 ay içinde başlangıç kilolarının en az %7'sini kaybetmelerini sağlayacak şekilde kalorisi azaltılmış ve kişiye göre düzenlenmiş beslenme programına başlatılır ve haftada en az 150 dakika orta derece yoğunlukta tempolu yürüme gibi fiziksel aktivite yapmaları önerilir."
  },
  {
    "soru": "Prediyabeti önlemede hangi diyet modelleri etkilidir?",
    "cevap": "Akdeniz tarzı beslenme, Dietary Approaches to Stop Hypertension (DASH) diyeti ve düşük karbonhidrat içeren diyet modelleri ile beslenmenin Tip 2 diyabet gelişimi açısından daha düşük riske sahip olduğu gösterilmiştir."
  },
  {
    "soru": "Diyabeti önlemek için hangi gıdaları tüketmeliyim, hangilerinden kaçınmalıyım?",
    "cevap": "Beslenmede tam tahıl, baklagiller, fındık, ceviz gibi kabuklu yemiş, sebze ve meyve ve lifli beslenmenin önemi vurgulanırken, işlenmiş ve paketlenmiş gıdalardan kaçınılması önerilmektedir."
  },
  {
    "soru": "Yaşam tarzı değişikliğine ek olarak prediyabet tedavisinde metformin kullanılabilir mi?",
    "cevap": "Yüksek riskli kişilerde (BAG+BGT ile ektekilerin birisi varsa HbA1c >%6, hipertansiyon, trigliserit yüksekliği, HDL-kolesterol ve birinci derece akrabalarda DM olması), obez ve 60 yaşın altında ise başlangıçta yaşam tarzı değişikliklerine ek olarak metformin tedavisi başlanabilir."
  },
  {
    "soru": "Metformin tedavisine hangi dozda başlanmalı?",
    "cevap": "Başlangıç dozu günde iki kez yemekten sonra 250-500 mg'dır. 1-2 haftada doz arttırılarak klinik olarak etkin olan 1.500-2.000 mg'a çıkılır."
  },
  {
    "soru": "Tıbbi beslenme tedavisinin (TBT) etkinliği nedir, HbA1c değerimi ne kadar düşürebilir?",
    "cevap": "Diyetisyen tarafından sağlanan TBT, HbA1c düzeyini, Tip 1 diyabetlilerde %1.0-1.9, Tip 2 diyabetlilerde %0,3-2 oranında azaltmaktadır."
  },
  {
    "soru": "Diyabetli bir yetişkin olarak beslenme tedavimin hedefleri neler olmalı?",
    "cevap": "Hedefler arasında sağlıklı beslenme alışkanlıklarını geliştirmek, bireysel ve kültürel tercihlere uygun bir plan oluşturmak, ideal vücut ağırlığına erişmek ve bunu devam ettirmek, ayrıca glisemi, kan basıncı ve lipid düzeylerini hedefe ulaştırmak yer alır."
  },
  {
    "soru": "Düşük karbonhidratlı diyetler diyabet yönetiminde etkili midir?",
    "cevap": "Düşük KH’lı diyetlerin Tip 2 diyabeti veya prediyabetli bireylerde kısa süreli uygulanmasının glisemi regülasyonu, plazma lipid düzeyleri ve vücut ağırlığı açısından olumlu etki gösterdiği bildirilmekle birlikte, uzun dönemde etkisini gösteren çalışmalar yetersizdir ve sürdürülebilirliği zordur."
  },
  {
    "soru": "Aralıklı oruç diyabet hastaları için uygun bir yöntem midir?",
    "cevap": "Aralıklı oruç, kısa sürelerde (8-12 hafta) hafif ila orta düzeyde kilo kaybı sağlar. İnsülin ve/veya sekretagog kullanan diyabetli kişiler oruç döneminde tıbbi olarak izlenmelidir."
  },
  {
    "soru": "Diyabetik bir birey olarak alkol tüketebilir miyim?",
    "cevap": "Diyabetli bireylere alkol alımı önerilmez. Alkol alımı hipoglisemiye ve vücut ağırlığında artışa yol açabilmektedir. Tercih ediliyorsa, yetişkin erkekler günde 2 birim, kadınlar ise günde 1 birim ile sınırlandırmalıdır."
  },
  {
    "soru": "Enerji vermeyen tatlandırıcıları kullanmamın bir sakıncası var mı?",
    "cevap": "Besleyici değeri olmayan tatlandırıcıları içeren bir gıda, şekerle tatlandırılmış bir gıda yerine kullanıldığında enerji ve karbonhidrat alımını azaltacak miktarda tüketiliyorsa tercih edilebilir."
  },
  {
    "soru": "Gestasyonel diyabetliyim, beslenmemde nelere dikkat etmeliyim?",
    "cevap": "Karbonhidrat alımı günlük enerji gereksiniminin %45-55'i, protein %15-20'si ve yağ %25-35'i olmalıdır. Düşük glisemik indeksli besin tüketimi önemlidir."
  },
  {
    "soru": "Karbonhidrat sayımı tekniği nedir ve nasıl uygulanır?",
    "cevap": "Karbonhidrat sayımı, öğünlerde alınan karbonhidrat miktarına göre insülin dozunu ayarlamaya yarayan üç aşamalı bir yöntemdir. Bireyin Karbonhidrat/İnsülin (K/İ) oranı saptanır ve hangi durumlarda nasıl kullanacağı öğretilir."
  },
  {
    "soru": "Karbonhidrat/İnsülin oranımı nasıl hesaplayabilirim?",
    "cevap": "Bir yöntem, 500'ü toplam günlük insülin dozuna bölmektir. Örneğin, toplam 50 ünite insülin kullanıyorsanız, 500/50=10 sonucuna göre her 10 gram karbonhidrat için 1 ünite insülin uygularsınız."
  },
  {
    "soru": "Egzersizin zamanlaması neden önemli?",
    "cevap": "İnsülin kullananlar için insülin etkisinin pik yaptığı saatlerde egzersizden sakınılmalıdır. Ayrıca KVH riski yüksek olanlarda stres hormonlarının yüksek olduğu sabah saatlerinde yapılan egzersiz riskli olabilir."
  },
  {
    "soru": "Diyabetli bir birey olarak uzun süre oturmanın bir zararı var mı?",
    "cevap": "Hiperglisemi üzerindeki faydasından dolayı hastaların uzun süre oturmamaları ve her 30 dakikada bir hareket etmeleri önerilir."
  },
  {
    "soru": "Tip 1 diyabetliyim. İnsülin tedavimin planlanmasında beslenmem nasıl dikkate alınır?",
    "cevap": "Tip 1 diyabeti olan bireylerde beslenme, hastanın insülin tedavisi ve fiziksel aktivitesine göre planlanmalıdır."
  },
  {
    "soru": "Tip 2 diyabetli bir birey olarak beslenmemin hedefleri neler olmalı?",
    "cevap": "Tip 2 diyabeti olan bireylerde kan şekeri kontrolünün yanında kan basıncı ve lipid parametrelerinde de iyileşme sağlayacak, doymuş ve trans yağlardan kısıtlı, sodyum alımının azaltıldığı bir beslenme modeli oluşturulmalıdır."
  },
  {
    "soru": "Yağlı karaciğer (MASLD) teşhisim var ve diyabetliyim. Kilo vermem neden önemli?",
    "cevap": "Kilonun %5’ini kaybetmenin yağlanma üzerine olumlu etkileri vardır. Kiloda %10 azalmanın steatozun tamamen düzelmesine, MASH tablosunun %90 gerilemesine ve hatta bazı hastalarda fibrozisin gerilemesine yol açtığı gösterilmiştir."
  },
  {
    "soru": "Yağlı karaciğerim için diyetimde nelere dikkat etmeliyim?",
    "cevap": "Liften zengin (20-40 g/gün), düşük doymuş yağ ve yüksek tekli doymamış yağ içeren Akdeniz diyeti, MASLD’yi geriletmede etkili bulunmuştur. Ayrıca günde 3 fincan veya daha fazla kahve tüketmenin MASLD ve fibrozis riskini azalttığı saptanmıştır."
  },
  {
    "soru": "Diyabetik ayak yarasını önlemek için beslenmenin rolü var mıdır?",
    "cevap": "Diyabetik ayak ülserlerinin yönetiminde kan şekeri regülasyonu, yaşam tarzı değişiklikleri ve beslenmenin düzenlenmesi gibi kompleks bir süreç yer almaktadır."
  },
  {
    "soru": "Diyabetik ayak yarası riskini azaltmak için hangi egzersizler önerilir?",
    "cevap": "Ayakla ilgili egzersizler, ayağın kuvvetini ve hareketlilik fonksiyonunu desteklemek amacıyla önerilir."
  },
  {
    "soru": "Diyabetim var, diş sağlığım için beslenmemde nelere dikkat etmeliyim?",
    "cevap": "Tedavi edilmeyen diş sorunları (çürük, apse vb.) dengeli beslenmeyi zorlaştırabilir. Ayrıca kontrolsüz diyabette tükürük glukoz seviyesindeki artış, dental plak ve diş çürüğü oluşumunu artırır."
  },
  {
    "soru": "Diyabetli ve hipertansiyonu olan bir birey için yaşam tarzı önerileri nelerdir?",
    "cevap": "Fazla kilolu veya obez ise ideal kiloya getirilmelidir. Diyet sebze ve meyveden zengin olmalı (DASH veya Akdeniz diyeti gibi), tuz tüketimi kısıtlanmalı (günlük 4 gramın altında), sigara yasaklanmalı ve alkol sınırlandırılmalıdır."
  },
  {
    "soru": "Lipid profilimi iyileştirmek için beslenmemde ne gibi değişiklikler yapmalıyım?",
    "cevap": "Akdeniz diyeti ya da DASH diyeti önerilir. Diyette doymuş yağlar ve trans yağlar azaltılmalı; n-3 yağ asidi, suda çözünen fiber ve bitkisel sterol/stanol içeriği arttırılmalıdır."
  },
  {
    "soru": "Trigliseritlerim yüksek, diyetimde neye dikkat etmeliyim?",
    "cevap": "Yüksek trigliserit (≥150 mg/dl) durumunda diyet ve egzersizin yoğunlaştırılması ve optimal kan şekeri kontrolü gerekmektedir. Açlık trigliserit düzeyi ≥500 mg/dl olan hastalarda, özellikle akut pankreatit riskini azaltmak için farmakolojik tedavi planlanmalıdır."
  },
  {
    "soru": "İnsülin duyarlılık faktörü (İDF) nedir ve nasıl hesaplanır?",
    "cevap": "İDF, 1 ünite kısa veya hızlı etkili insülinin kan glukozunu ne kadar düşürdüğünü gösterir. Hızlı etkili analog insülin için 1800'ün, kısa etkili regüler insülin için ise 1500'ün toplam günlük insülin dozuna bölünmesiyle hesaplanır."
  },
  {
    "soru": "Öğün öncesi yüksek kan şekerimi düzeltmek için ne kadar ek insülin yapmalıyım?",
    "cevap": "İnsülin düzeltme dozu, (Bulunan Kan Glukozu - Hedef Kan Glukozu) / İnsülin Duyarlılık Faktörü formülü ile hesaplanır. Örneğin, kan şekeriniz 270 mg/dl, hedefiniz 120 mg/dl ve İDF'niz 30 ise, (270-120)/30 = 5 ünite ek insülin yapmanız gerekir."
  },
  {
    "soru": "Egzersiz sonrası hipoglisemi riski ne kadar sürer ve nasıl önlenir?",
    "cevap": "Egzersize bağlı hipoglisemi riski 24 saat sürebilir. Bunu önlemek için gece yapılan bazal insülin dozunu %20 oranında azaltmak gerekebilir."
  },
  {
    "soru": "Tip 1 diyabetli çocuğum için beslenme ve egzersiz planı nasıl olmalı?",
    "cevap": "Tip 1 diyabette hasta takibinde tıbbi beslenme tedavisi (TBT) ve fiziksel aktivite durumu her vizitte kontrol edilmelidir. Egzersiz öncesi kan şekeri <100 mg/dl altında ise karbonhidrat alımı yapılmalıdır. Hipoglisemi riski açısından egzersiz öncesi ve sonrası kan şekeri takibi yapılmalıdır."
  },
  {
    "soru": "Diyabetik ketoasidoz (DKA) riskini azaltmak için beslenme ve egzersizde nelere dikkat etmeliyim?",
    "cevap": "Diyabetik ketoasidoz (DKA) mutlak veya göreceli insülin eksikliği durumlarında ortaya çıkar. Yetersiz insülin kullanımı, enfeksiyonlar, stres gibi durumlar riski artırır. Bu nedenle glisemik kontrolü sağlayan düzenli beslenme ve insülin tedavisine uyum, ayrıca kan şekerini aşırı yükselten durumlarda egzersizden kaçınmak önemlidir."
  },
  {
    "soru": "Hipoglisemi yaşadığımda ne yemeliyim?",
    "cevap": "Şuuru açık ve yutabilen bir hasta için 15-20 gr karbonhidrat (150-200 ml meyve suyu -tercihen elma, üzüm, vişne suyu- veya 4-5 adet kesme şeker veya 3-4 glukoz tablet) oral yolla alınabilir."
  },
  {
    "soru": "Hipoglisemi tedavisinde proteinli gıdalar kullanmalı mıyım?",
    "cevap": "Protein içeren KH’lı besinler, akut hipoglisemide veya gece hipoglisemilerinin tedavisinde kullanılması önerilmemektedir."
  },
  {
    "soru": "Diyabetik böbrek hastalığım (nefropati) var. Beslenmemde özellikle nelere dikkat etmeliyim?",
    "cevap": "Diyalize ihtiyacı olmayan kronik böbrek hastalığı olan hastalarda diyetle protein alımı günde yaklaşık 0,8 g/kg olmalıdır. Diyette sodyum miktarının <2.300 mg/gün düzeyine kısıtlanması kan basıncı kontrolü için yararlı olabilir."
  },
  {
    "soru": "Diyabetik nöropatim var. Yaşam tarzımda ne gibi değişiklikler yapmalıyım?",
    "cevap": "Diyabetik nöropatinin önlenebilmesi için glisemik kontrol ve yaşam tarzı değişikliklerine odaklanılmalıdır. Prediyabetik, metabolik sendromlu veya Tip 2 diyabetli hastalarda distal simetrik polinöropatiyi önlemede yaşam tarzına yönelik girişimler mutlaka uygulanmalıdır."
  },
  {
    "soru": "Yaşam tarzı değişikliği hangi bileşenlerden oluşur?",
    "cevap": "Yaşam tarzı değişikliği; tıbbi beslenme tedavisi (TBT) ve egzersizi içerir ve diyabetin önlenmesi ile tedavisinde temel taştır."
  },
  {
    "soru": "Beslenme tedavisi için bir diyetisyene görünmeli miyim?",
    "cevap": "Evet, tüm diyabetli bireylere, tercihen diyabete özgü TBT verme konusunda bilgili ve deneyimli bir diyetisyen (mümkünse diyabet diyetisyeni) tarafından bireyselleştirilmiş TBT düzenlenmelidir."
  },
  {
    "soru": "Diyabet diyeti için öğün planlaması nasıl yapılır?",
    "cevap": "Besin tüketimi bireyin beslenme alışkanlıkları dikkate alınarak ana ve ara öğünlere (2-3 ana, 2-4 ara öğün) dağıtılır."
  },
  {
    "soru": "Kolesterol alımımı ne kadarla sınırlamalıyım?",
    "cevap": "Kolesterol alımı, günde 300 mg'dan az olmalıdır."
  },
  {
    "soru": "Diyabet tedavisinde tıbbi beslenme tedavisinin (TBT) temel ilkeleri nelerdir?",
    "cevap": "TBT'nin temel ilkeleri; beslenmenin bireysel olarak değerlendirilmesi, enerji ve besin öğesi alımının kişiye özel hedeflere göre planlanması, düzenli öğünler, yeterli posa alımı ve sağlıklı yağların tercih edilmesidir."
  },
  {
    "soru": "Diyabetli bir birey için trans yağ alımı ne kadar olmalıdır?",
    "cevap": "Trans yağ alımı, günlük enerji gereksiniminin %1'ini (yaklaşık 2 g/gün) aşmamalıdır."
  },
  {
    "soru": "Vitamin veya mineral takviyesi kullanmalı mıyım?",
    "cevap": "Klinik veya laboratuvar olarak bir yetersizlik belirtisi olmadığı sürece, diyabetli bireylere rutin vitamin-mineral takviyesi önerilmez."
  },
  {
    "soru": "Trigliserit seviyem 150 mg/dl'den yüksek. Beslenmemde ne gibi değişiklikler yapmalıyım?",
    "cevap": "Trigliserit seviyeniz 150 mg/dl'den yüksekse, tekli doymamış yağ ve omega-3 yağ asidi alımınızı artırmalı, karbonhidrat türünüzü ve miktarını diyetisyeninizle birlikte değerlendirmelisiniz."
  },
  {
    "soru": "Trigliseritlerim 500 mg/dl'nin üzerinde, bu durumda diyetim nasıl olmalı?",
    "cevap": "Trigliserit seviyeniz 500 mg/dl'nin üzerindeyse, akut pankreatit riskini azaltmak için yağ alımınız ciddi şekilde kısıtlanmalıdır (günlük enerjinin %15'inden az)."
  },
  {
    "soru": "LDL (kötü) kolesterolüm 100 mg/dl'den yüksek. Ne yapmalıyım?",
    "cevap": "LDL kolesterolünüz 100 mg/dl'den yüksekse, doymuş yağ alımınızı azaltmalı (günlük enerjinin %7'sinden az), tekli doymamış yağ ve posa alımınızı artırmalısınız."
  },
  {
    "soru": "Diyabete bağlı böbrek hastalığım var. Protein alımımı nasıl ayarlamalıyım?",
    "cevap": "Diyabete bağlı böbrek hastalığı varlığında, protein alımı günde 0,8 g/kg'ı geçmemelidir."
  },
  {
    "soru": "Hipertansiyonum varsa tuz alımım ne kadar olmalı?",
    "cevap": "Kan basıncınız 130/80 mmHg veya üzerindeyse, sodyum alımınız kısıtlanmalıdır (günde 1,5 gramdan az)."
  },
  {
    "soru": "Beslenme tedavisi için diyetisyenle ne sıklıkla görüşmeliyim?",
    "cevap": "Tıbbi beslenme tedavisi genellikle 3-6 ay içinde tamamlanan, her biri 45-90 dakika süren 3-4 viziti kapsar. Hedeflere ulaşıldığında ise yılda 3-4 kez kontrol önerilir."
  },
  {
    "soru": "Diyabetli bireylerde yeme bozukluğu ne sıklıkla görülür?",
    "cevap": "Diyabetli bireylerde yeme bozukluğu oranı %18-40 arasındadır. Tip 2 diyabetlilerde en sık tıkınırcasına yeme bozukluğu, Tip 1 diyabetlilerde ise kilo kaybı için insülin dozunu atlama davranışı görülür."
  },
  {
    "soru": "Şekerle tatlandırılmış içecekleri tüketebilir miyim?",
    "cevap": "Şekerle tatlandırılmış içeceklerin ve 'az yağlı' veya 'yağsız' olarak belirtilse de şeker ilaveli, yüksek oranda rafine edilmiş gıda ürünlerinin tüketilmesi önerilmez."
  },
  {
    "soru": "Karışım insülin kullanıyorum. Karbonhidrat alımım nasıl olmalı?",
    "cevap": "Karışım insülin kullanan Tip 2 diyabetli bireyler için günden güne ve öğünden öğüne değişmeyen sabit karbonhidrat alımının önemi vurgulanmalıdır."
  },
  {
    "soru": "Karbonhidrat sayımı yapamayacak durumdaki yaşlı veya bilişsel bozukluğu olan hastalar için nasıl bir öğün planı önerilir?",
    "cevap": "Bu hastalar için porsiyon kontrolü ve sağlıklı besin tercihlerini vurgulayan 'tabak modeli' gibi basit bir öğün planı yaklaşımı daha uygundur."
  },
  {
    "soru": "Diyabetli bir bireyde protein alımı insülin yanıtını nasıl etkiler?",
    "cevap": "Tip 2 diyabetli bireylerde proteinlerin alımı, kan glukoz düzeyini artırmaksızın insülin yanıtını artırabilir."
  },
  {
    "soru": "Omega-3 takviyesi kullanmalı mıyım?",
    "cevap": "Haftada iki veya daha fazla porsiyon balık tüketimi önerilir. Ancak omega-3 gıda takviyelerinin rutin kullanımının yararlı olduğuna dair yeterli kanıt bulunmamaktadır."
  },
  {
    "soru": "Metformin kullanıyorum, B12 vitamini eksikliği riski var mı?",
    "cevap": "Evet, metformin kullanımında B12 vitamini eksikliği olabilir. Bu nedenle periyodik olarak kontrol edilmesi ve gerekirse takviye yapılması önemlidir."
  },
  {
    "soru": "Diyabet tedavisinde tarçın, zerdeçal veya krom gibi bitkisel desteklerin faydası var mı?",
    "cevap": "Tarçın, zerdeçal, D vitamini, krom gibi bitkisel desteklerin ve mikro besin öğelerinin rutin kullanımının kan şekeri regülasyonunu sağladığını destekleyen kanıtlar yetersizdir."
  },
  {
    "soru": "Gestasyonel diyabetli bir gebe olarak karbonhidrat alımım en az ne kadar olmalı?",
    "cevap": "Gebelerde karbonhidrat alımı minimum 175 g/gün, emziren annelerde ise 210 g/gün olmalıdır."
  },
  {
    "soru": "Karbonhidrat sayımında '1 KH seçeneği' ne anlama geliyor?",
    "cevap": "15 gram karbonhidrat, '1 KH seçeneği' olarak kabul edilir. Bu miktar, değişim listelerindeki besinlerin pratik olarak bir servis ölçüsünden sağlanır."
  },
  {
    "soru": "Egzersiz yaparken yorulursam veya göğsümde ağrı olursa ne yapmalıyım?",
    "cevap": "Aşırı yorgunluk, baş dönmesi, göğüs ağrısı, nefes darlığı gibi bulgular varsa egzersiz hemen sonlandırılmalıdır."
  },
  {
    "soru": "Direnç egzersizi nedir ve ne sıklıkla yapmalıyım?",
    "cevap": "Direnç egzersizleri, bir yüke karşı veya ağırlıklarla yapılan egzersizlerdir. Ardışık olmayan günlerde olacak şekilde haftanın 2-3 günü egzersiz programına eklenmelidir."
  },
  {
    "soru": "Yaşlı bir diyabetli olarak hangi egzersizleri yapabilirim?",
    "cevap": "Özellikle yaşlı bireylere esnekliği ve kas kuvvetini artırmak için germe ve denge egzersizleri (yoga, tai-chi, pilates vb.) haftanın 2-3 günü önerilir."
  },
  {
    "soru": "Tehlikeli sporlar yapabilir miyim?",
    "cevap": "Hipoglisemi riski göz önünde bulundurularak, insülin kullananların dağa tırmanma, su altı dalışı gibi tek başına yapılacak tehlikeli aktivitelerden sakınmaları önerilir."
  },
  {
    "soru": "Diyabetli bir birey için ideal HbA1c hedefi nedir?",
    "cevap": "Hipoglisemi riski düşük, hastalık süresi kısa, komplikasyon gelişmemiş erişkin gebe olmayan diyabetiklerde HbA1c hedefi ≤%7 olmalıdır. Ancak bu hedef, hastanın durumuna göre bireyselleştirilmelidir."
  },
  {
    "soru": "Yaşlı ve kırılgan bir hastada HbA1c hedefi ne olmalı?",
    "cevap": "Sağlığı ileri derecede bozulmuş, kırılgan yaşlılarda ve yaşam beklentisi kısa olan hastalarda HbA1c %8-8,5 arasında tutulabilir. Öncelik hipoglisemi ve semptomatik hiperglisemiden kaçınmaktır."
  },
  {
    "soru": "Diyabetli bir bireyde obezite tedavisi için farmakoterapi ne zaman düşünülmelidir?",
    "cevap": "Yaşam tarzı değişiklikleri ile hedeflenen ağırlık kaybına ulaşılamadığında obeziteye yönelik farmakoterapi planlanmalıdır."
  },
  {
    "soru": "Bariyatrik cerrahi (obezite ameliyatı) sonrası beslenmem nasıl olacak?",
    "cevap": "Cerrahi sonrası hastalar uzun vadeli tıbbi ve davranışsal destek almalı; mikro besin, beslenme ve metabolik durumları rutin olarak takip edilmelidir. Dumping sendromu, vitamin-mineral eksiklikleri ve hipoglisemi açısından dikkatli olunmalıdır."
  },
  {
    "soru": "Gestasyonel diyabet tanısı aldım. Doğumdan sonra diyabetim geçer mi?",
    "cevap": "Doğum sonrasında genellikle kan şekeri düzeyleri normal seviyelere inerse de, hayatın ileri yıllarında bu kadınlarda aşikar diyabet gelişme riski %70 civarındadır."
  },
  {
    "soru": "Gestasyonel diyabet tedavisinde ilk seçenek nedir?",
    "cevap": "Glukoz regülasyonunun sağlanabilmesi için tedavide öncelikli seçenek diyet ve egzersizdir. Hastaların yaklaşık %80'inde bu yöntemlerle kan şekeri regülasyonu sağlanır."
  },
  {
    "soru": "Gestasyonel diyabette kan şekeri hedeflerim neler olmalı?",
    "cevap": "Optimal glisemik hedefler; açlık kan şekeri <95 mg/dl, yemekten 1 saat sonraki tokluk kan şekeri <140 mg/dl ve 2. saat tokluk kan şekeri <120 mg/dl olmalıdır."
  },
  {
    "soru": "Diyabetli bir kadın hamile kalmadan önce nelere dikkat etmeli?",
    "cevap": "Gebelik planlı olmalı, gebelik öncesinden başlayarak optimal kan şekeri regülasyonu (HbA1c ≤%6,5) sağlanmalı ve sürdürülmelidir. Nöral tüp defektini önlemek için prekonsepsiyonel dönemden itibaren 5 mg/gün folik asit desteğine başlanmalıdır."
  },
  {
    "soru": "Ameliyat olacağım, diyabetim var. Ameliyat öncesi HbA1c değerim kaç olmalı?",
    "cevap": "Elektif cerrahi öncesi ideal HbA1c değeri <%8,0 olması önerilir. Glisemik kontrolü kötü ise (HbA1c >%9) elektif cerrahinin ertelenmesi düşünülebilir."
  },
  {
    "soru": "Sadece diyetle kontrol altında olan Tip 2 diyabet hastasıyım ve minör bir cerrahi geçireceğim. Beslenmem nasıl olmalı?",
    "cevap": "Operasyon sabahı aç olmalısınız. Operasyon sonrası oral beslenmeye geçildiğinde normal diyetinize dönebilirsiniz. Kan şekeriniz hedeflerin üzerinde seyrederse kısa veya hızlı etkili insülinlerle müdahale edilebilir."
  },
  {
    "soru": "Kolonoskopi yaptıracağım ve diyabetliyim. İşlemden önceki gün beslenmem nasıl olmalı?",
    "cevap": "Kolonoskopiden önceki gün, sıvı bir diyet uygulamanız ve bağırsak temizliği protokolüne uymanız gerekecektir. İnsülin veya oral antidiyabetik ilaçlarınızın dozları, hipoglisemi riskini önlemek için doktorunuz tarafından ayarlanmalıdır."
  },
  {
    "soru": "Diyabetli bireylerde psikososyal durum neden önemlidir?",
    "cevap": "Depresyon ve anksiyete gibi psikososyal sorunlar diyabet yönetimini zorlaştırabilir, kontrolsüz hiperglisemiye veya tekrarlayan hipoglisemilere yol açabilir. Bu nedenle hastaların bu açıdan da değerlendirilmesi önemlidir."
  },
  {
    "soru": "Diyabetli bireyler hangi aşıları olmalıdır?",
    "cevap": "Tüm diyabetliler yaşına göre erişkin aşılama programını takip etmelidir. Özellikle yıllık influenza (grip) aşısı, pnömokok (zatürre) aşısı ve hepatit B aşısı önerilmektedir."
  },
  {
    "soru": "Diyabetik ayak riskim yüksek. Ayak bakımı için nelere dikkat etmeliyim?",
    "cevap": "Ayaklarınızı her gün ılık su ile yıkayıp parmak araları dahil kurulamalı, nemlendirici sürmeli, çıplak ayakla basmamalı, uygun ayakkabı ve dikişsiz çorap giymeli ve tırnaklarınızı düz kesmelisiniz."
  },
  {
    "soru": "Ayaklarımda nasır var. Bu bir risk midir?",
    "cevap": "Evet, pre-ülseratif nasır ve kalluslar diyabetik ayak ülseri için bir risk faktörüdür. Bunları gidermek için kimyasal maddelerden veya alçılardan kaçınılmalı ve bir uzmana danışılmalıdır."
  },
  {
    "soru": "Diyabetik retinopatiyi önlemek için yaşam tarzımda ne yapabilirim?",
    "cevap": "Glisemik kontrol, kan basıncı kontrolü ve dislipidemi kontrolü gibi sistemik risk faktörlerinin kontrolü ile diyabetik retinopati gelişimi geciktirilebilir ve/veya varlığında progresyonu yavaşlatılabilir."
  },
  {
    "soru": "Diyabet ve inme riski arasında bir ilişki var mı? Yaşam tarzımla bu riski azaltabilir miyim?",
    "cevap": "Evet, diyabet inme için önemli bir bağımsız risk faktörüdür. Hipertansiyon, hiperlipidemi, obezite gibi risk faktörlerini yaşam tarzı değişiklikleri, diyet ve egzersizle kontrol altına alarak inme riskini azaltabilirsiniz."
  },
  {
    "soru": "Doktorum prediyabet tanısı koydu. Bu tam olarak ne anlama geliyor?",
    "cevap": "Prediyabet, kan şekeri (glukoz) ve HbA1c değerlerinizin normalden yüksek olduğu, ancak henüz diyabet tanısı koymak için yeterli olmadığı bir durumu ifade eder. Bu, diyabet gelişme riskinizin yüksek olduğu anlamına gelir."
  },
  {
    "soru": "Açlık kan şekerimin 110 mg/dl çıkması ne anlama geliyor?",
    "cevap": "Açlık plazma glukozunun 100-125 mg/dl arasında olması, 'Bozulmuş Açlık Glukozu' (BAG) olarak tanımlanan bir prediyabet durumudur. Bu durumda diyabet riskini değerlendirmek için ek testler veya yaşam tarzı değişiklikleri gerekebilir."
  },
  {
    "soru": "HbA1c değerimin %6.1 olması neyi ifade ediyor?",
    "cevap": "HbA1c değerinizin %5,7 ile %6,4 arasında olması, prediyabet aralığında olduğunuzu gösterir. Bu, son 2-3 aydaki ortalama kan şekeri seviyenizin normalden yüksek olduğuna işaret eder ve Tip 2 diyabet geliştirme riskinizin arttığını gösterir."
  },
  {
    "soru": "Yemekten sonraki 1. saat kan şekerim 160 mg/dl çıktı. Bu bir sorun mu?",
    "cevap": "75 gramlık şeker yükleme testinin (OGTT) 1. saatinde kan şekerinin ≥155 mg/dl bulunması 'ara hiperglisemi' olarak değerlendirilir ve yaşam tarzı değişikliği planlanması önerilir."
  },
  {
    "soru": "Kimler Tip 2 diyabet için risk altındadır ve beslenmesine daha çok dikkat etmelidir?",
    "cevap": "Fazla kilolu/obez olmak, fiziksel olarak inaktif olmak, ailede diyabet öyküsü bulunması, gestasyonel diyabet geçmişi, polikistik over sendromu (PKOS), hipertansiyon ve dislipidemi gibi faktörler Tip 2 diyabet için önemli risk faktörleridir."
  },
  {
    "soru": "Metformin kullanıyorum ve midemde gaz, şişkinlik gibi sorunlar yaşıyorum. Bu normal mi?",
    "cevap": "Evet, metformin kullanımında gaz, şişkinlik, diyare gibi gastrointestinal yan etkiler görülebilir. Bu yan etkiler genellikle geçicidir."
  },
  {
    "soru": "Pioglitazon adlı ilacı kullanıyorum, kilo aldırır mı?",
    "cevap": "Evet, pioglitazon kullanımının yan etkileri arasında kilo artışı ve sıvı retansiyonu bulunmaktadır."
  },
  {
    "soru": "Akarboz adlı ilacı nasıl kullanmalıyım?",
    "cevap": "Akarboz, ana öğünlerden önce alınır. Yan etkileri azaltmak için en düşük dozda başlanması ve ilk lokma ile çiğnenerek alınması önerilir."
  },
  {
    "soru": "Glinid grubu (Nateglinid, Repaglinid) bir ilaç kullanıyorum. Öğün atlarsam ilacı almalı mıyım?",
    "cevap": "Hayır, hasta öğün atlarsa ilaç alınmamalıdır. Bu ilaçlar öğünle ilişkili insülin salgısını artırdığı için öğünle birlikte alınmalıdır."
  },
  {
    "soru": "Sülfonilüre grubu (Gliklazid, Glimepirid vb.) ilaçlar kilo almama neden olur mu?",
    "cevap": "Evet, sülfonilüre grubu ilaçların yan etkileri arasında hipoglisemi ve kilo alımı bulunmaktadır."
  },
  {
    "soru": "SGLT-2 inhibitörü (Dapagliflozin, Empagliflozin) kullanıyorum. Bu ilacın kilo üzerine etkisi var mıdır?",
    "cevap": "Evet, SGLT-2 inhibitörlerinin klinik yararları arasında ağırlık kaybı ve kan basıncında azalma bulunmaktadır."
  },
  {
    "soru": "GLP-1 reseptör agonisti (Liraglutid, Semaglutid vb.) bir iğne kullanıyorum. Bu tedavinin amacı nedir?",
    "cevap": "Bu ilaçlar glukoza bağlı insülin salgısını artırır, mide boşalmasını yavaşlatır ve iştahı azaltır. Bu sayede hem glisemik kontrol sağlar hem de kilo kaybına yardımcı olur."
  },
  {
    "soru": "Tirzepatid (ikili agonist) tedavisinin kilo kaybı üzerinde belirgin bir etkisi var mı?",
    "cevap": "Evet, Tirzepatid, hipoglisemi riski oluşturmadan etkili kan şekeri düşüşü ve belirgin ağırlık kaybı sağlar."
  },
  {
    "soru": "Bazal insülin kullanıyorum ve dozum sürekli artıyor. 'Aşırı bazal insülin kullanımı' ne demektir?",
    "cevap": "Aşırı bazal insülin kullanımı (over-basalization), yatma öncesi ve sabah açlık glukoz farkının 50 mg/dl'yi geçmesi, hipoglisemi ve gün içinde artmış glukoz değişkenliği gibi bulgularla kendini gösteren bir durumdur. Bu, öğün sonrası kan şekerini kontrol etmek için bazal insülinin aşırı kullanıldığı anlamına gelir."
  },
  {
    "soru": "Sürekli glukoz takip sistemi (sensör) kullanıyorum. 'Hedefte geçirilen süre' (HGS) ne anlama geliyor?",
    "cevap": "Hedefte Geçirilen Süre (HGS veya TIR), sensör tarafından ölçülen kan şekeri düzeylerinin istenen aralıkta (genellikle 70-180 mg/dl) olduğu sürenin yüzdesidir. Tip 1 ve Tip 2 diyabetlilerde bu oranın >%70 olması hedeflenir."
  },
  {
    "soru": "Sensör raporumda 'Glukoz Yönetim Göstergesi' (GMI) diye bir değer var. Bu nedir?",
    "cevap": "Glukoz Yönetim Göstergesi (GMI), sensör verilerinden elde edilen tahmini Hemoglobin A1c (eHbA1c) değeridir ve glisemik kontrolünüz hakkında bir fikir verir."
  },
  {
    "soru": "Sensör verilerine göre glisemik değişkenliğimin (CV) ideal değeri ne olmalı?",
    "cevap": "İdeal glisemik değişkenlik (CV) hedefi ≤%36 olarak belirlenmiştir. Hipoglisemi riski yüksek bireylerde ise CV'nin <%33 olması hedeflenebilir."
  },
  {
    "soru": "İnsülin pompası kullanmanın ne gibi riskleri veya yan etkileri olabilir?",
    "cevap": "İnsülin pompası tedavisinin yan etkileri arasında infüzyon bölgesinde cilt tahrişi/enfeksiyonu, pompa arızası nedeniyle ketoasidoz (DKA) riski, fazla insülin verilmesine bağlı hipoglisemi ve lipohipertrofi (yağ dokusu birikimi) sayılabilir."
  },
  {
    "soru": "Şafak fenomeni (dawn phenomenon) nedir ve insülin pompası bu durumu yönetmeme yardımcı olabilir mi?",
    "cevap": "Şafak fenomeni, sabah erken saatlerde kan şekerinin yükselmesidir. İnsülin pompaları, bu saatlerde bazal insülin hızını otomatik olarak ayarlayarak bu durumu yönetmek için etkin bir yöntemdir ve pompa tedavisi için bir endikasyondur."
  },
  {
    "soru": "İnsülin iğnelerimi hep aynı yere yapıyorum. Bunun bir sakıncası var mı?",
    "cevap": "Evet, sürekli aynı bölgeye enjeksiyon yapmak lipohipertrofiye (insülin emilimini bozan yağ dokusu birikimi) neden olabilir. Bu nedenle enjeksiyon bölgeleri karın, uyluk, kol ve kalça arasında sistematik olarak değiştirilmelidir."
  },
  {
    "soru": "Çocuğumda Tip 1 diyabet var. Beslenme eğitiminde nelere dikkat edilmeli?",
    "cevap": "Tip 1 diyabetli çocuklarda, karbonhidrat sayımı eğitimi önerilir. Kan şekerinin daha dengeli seyretmesi için lif tüketimi ve düşük glisemik indeksli besinler önemlidir."
  },
  {
    "soru": "Kalp yetmezliğim var ve diyabetliyim. Beslenmemde özellikle dikkat etmem gereken bir şey var mı?",
    "cevap": "Kalp yetmezliği olan diyabetli hastalarda yaşam tarzı değişikliği, TBT ve egzersiz esastır. Kan basıncı ve kilo kontrolü hedeflenir. Özellikle tuz alımının kısıtlanması ve sıvı dengesinin korunması önemlidir."
  },
  {
    "soru": "Pioglitazon ve saksagliptin gibi ilaçlar kalp yetmezliği olan hastalarda kullanılabilir mi?",
    "cevap": "Hayır, kalp yetmezliği nedeniyle hastaneye yatışı artırdığı ve kalp yetmezliğini kötüleştirebileceği gösterilen saksagliptin ve pioglitazon gibi ilaçlar bu hastalarda verilmemelidir."
  },
  {
    "soru": "Diyabetik kardiyomiyopati nedir? Beslenme ve egzersizle önlenebilir mi?",
    "cevap": "Diyabetik kardiyomiyopati, diyabetli hastalarda hipertansiyon veya koroner arter hastalığı gibi belirli bir neden olmadan gelişebilen kalp kası hastalığıdır. Riski azaltmak için optimal glisemik kontrol, kan basıncı kontrolü, kilo yönetimi ve düzenli egzersiz gibi yaşam tarzı önlemleri kritik öneme sahiptir."
  },
  {
    "soru": "Diyabetik ayak oluşumunu önlemek için beslenme ve egzersizin rolü nedir?",
    "cevap": "Diyabetik ayak komplikasyonlarının önlenmesinde ve yönetiminde iyi bir glisemik kontrol (A1c <%7) gerekmektedir. Egzersiz ise kan dolaşımını iyileştirerek ve kas gücünü koruyarak riski azaltmaya yardımcı olabilir. Ancak nöropatisi olanlar için uygun egzersiz seçimi önemlidir."
  },
  {
    "soru": "Alkol tüketiminin diyabetik nöropati üzerinde bir etkisi var mıdır?",
    "cevap": "Evet, alkol ve nikotin kullanımı diyabetik nöropati için risk faktörleri arasında sayılmaktadır."
  },
  {
    "soru": "Diyabetik gastroparezi (mide boşalmasında yavaşlama) semptomlarım var. Diyetim nasıl olmalı?",
    "cevap": "Gastroparezi tedavisinde küçük ve sık öğünler, düşük yağlı ve düşük lifli bir diyet önerilir. Bu durum, yiyeceklerin midede daha uzun süre kalmasını önleyerek semptomları hafifletebilir."
  },
  {
    "soru": "Diyabet ve Alzheimer hastalığı arasında bir ilişki var mı? Yaşam tarzım riski etkiler mi?",
    "cevap": "Evet, Tip 2 diyabet Alzheimer hastalığı için bir risk faktörüdür ve bu duruma 'Tip 3 diyabet' de denmektedir. İyi glisemik kontrol ve sağlıklı yaşam tarzı alışkanlıklarının (diyet, egzersiz) bu riski yönetmede önemli olduğu düşünülmektedir."
  },
  {
    "soru": "Obezitesi olan bir diyabet hastasıyım, bariyatrik cerrahi benim için uygun mu?",
    "cevap": "BKİ'si 35-39,9 kg/m² olan ve ilaçlarla hiperglisemisi kontrol altına alınamayan Tip 2 DM'li hastalarda veya BKİ'si ≥40 kg/m² olan bireylerde bariyatrik cerrahi düşünülebilir. Karar multidisipliner bir değerlendirme ile verilmelidir."
  },
  {
    "soru": "Emziren bir anneyim ve gestasyonel diyabet geçmişim var. Beslenmem ve insülin ihtiyacım nasıl değişir?",
    "cevap": "Laktasyon (emzirme) döneminde annede enerji ve kalori ihtiyacı artar. Bu nedenle diyet, egzersiz ve insülin tedavisi buna göre yeniden planlanmalıdır. Laktasyon özellikle gece hipoglisemisi riskini artırabilir, bu yüzden kan şekeri yakından izlenmelidir."
  },
  {
    "soru": "Diyabetik bir bireyde glisemik kontrolün kötü olması ağız ve diş sağlığını nasıl etkiler?",
    "cevap": "Kötü metabolik kontrol, ağız ve diş hastalıkları sorunlarına zemin hazırlar. Tükürükte glukoz konsantrasyonunu artırarak dental plak oluşumunu, diş çürüğünü ve dişeti hastalığını tetikler. Ayrıca yara iyileşmesinde gecikmeye neden olabilir."
  },
  {
    "soru": "Diş tedavisi için randevumu günün hangi saatine almalıyım?",
    "cevap": "Hipoglisemi riskini azaltmak açısından diş hekimi randevusunun sabah saatlerinde alınması önerilir. Randevuya gitmeden önce öğün atlanmamalı ve kan şekeri ölçümü yapılmalıdır."
  },
  {
    "soru": "Diyabetli hastalar için özel bir 'kapsamlı yaklaşım' kontrol listesi var mı?",
    "cevap": "Evet, diyabetli hastaya kapsamlı yaklaşım; tıbbi öykü, diyabet öyküsü, komplikasyonların sorgulanması, yaşam tarzı ve davranış özellikleri, ilaç öyküsü, psikososyal durum, fizik muayene ve laboratuvar tetkiklerini içeren düzenli bir takip planını içerir."
  },
  {
    "soru": "Diyabetim var ve enfeksiyonlara daha mı yatkınım? Beslenmem bağışıklığımı güçlendirir mi?",
    "cevap": "Evet, diyabetli hastalar hiperglisemiye bağlı bağışıklığın bozulması gibi nedenlerle enfeksiyonlara daha yatkındır. Yeterli ve dengeli bir beslenme planı, genel sağlık durumunu iyileştirerek ve glisemik kontrolü sağlayarak bağışıklık sistemini desteklemeye yardımcı olur."
  },
  {
    "soru": "Diyabetik ketoasidoz (DKA) geçirdim. Bu durumun beslenme ile bir ilgisi var mı?",
    "cevap": "DKA, mutlak veya göreceli insülin eksikliğinden kaynaklanır. Yetersiz beslenme veya öğün atlama gibi durumlar, özellikle insülin dozu ayarlanmazsa, hipoglisemiye ve ardından düzensiz kan şekeri yönetimiyle DKA riskine katkıda bulunabilir. Düzenli beslenme ve tedaviye uyum çok önemlidir."
  },
  {
    "soru": "Hiperosmolar Hiperglisemik Durum (HHD) nedir ve beslenme bunu tetikler mi?",
    "cevap": "HHD, genellikle Tip 2 diyabetli yaşlı hastalarda görülen, ciddi hiperglisemi ve dehidratasyon ile karakterize bir durumdur. Yetersiz sıvı alımı ve malnütrisyon (kötü beslenme) bu durumu tetikleyebilir."
  },
  {
    "soru": "Diyabetik bir birey olarak sağlıklı beslenme alışkanlıklarını nasıl geliştirebilirim?",
    "cevap": "Sağlıklı beslenme alışkanlıkları geliştirmek için işlenmiş gıdalardan kaçınmalı, tam tahıllara, baklagillere, sebze ve meyvelere odaklanmalısınız. Öğün planlaması ve porsiyon kontrolü önemlidir. Bu süreçte bir diyetisyenden destek almak en doğrusudur."
  },
  {
    "soru": "Diyabetik nöropati (sinir hasarı) ağrılarım var. Beslenmemin bu ağrılara bir etkisi olabilir mi?",
    "cevap": "Diyabetik nöropatinin temel tedavisi iyi glisemik kontroldür. Dengeli beslenme, kan şekerinizi kontrol altında tutarak nöropatinin ilerlemesini yavaşlatmaya ve semptomları yönetmeye yardımcı olabilir. Ayrıca, metformin kullanıyorsanız B12 vitamini seviyeleriniz kontrol edilmelidir, çünkü eksikliği nöropatiyi kötüleştirebilir."
  },
  {
    "soru": "Yağlı karaciğer (MASLD) ve diyabetim var. Kahve içmemin bir faydası olur mu?",
    "cevap": "Evet, yapılan çalışmalarda günde 3 fincan veya daha fazla kahve tüketmenin MASLD ve fibrozis riskini azaltmada etkili olduğu bulunmuştur."
  },
  {
    "soru": "Düşük karbonhidratlı diyetler gebelikte güvenli midir?",
    "cevap": "Hayır, gebe ve emzikli kadınlar için düşük karbonhidratlı diyetler uygun değildir. Gebelikte minimum 175 g/gün karbonhidrat alımı önerilmektedir."
  },
  {
    "soru": "Egzersiz yaparken yeterli sıvı alımı neden bu kadar önemli?",
    "cevap": "Egzersiz sırasında terleme ile sıvı kaybedilir. Yeterli sıvı alımı, dehidratasyonu (vücudun susuz kalması) önler, kan şekerinin düzenlenmesine yardımcı olur ve genel performansı artırır."
  },
  {
    "soru": "Diyabetli bir birey için 'sağlıklı tabak modeli' nedir?",
    "cevap": "Sağlıklı tabak modeli, porsiyon kontrolü için kullanılan basit bir yöntemdir. Tabağınızın yarısını nişastalı olmayan sebzelerle (salata, brokoli, ıspanak vb.), dörtte birini protein kaynaklarıyla (tavuk, balık, baklagiller) ve kalan dörtte birini de tam tahıllı karbonhidratlarla (esmer pirinç, tam buğday ekmeği, kinoa) doldurmayı hedefler."
  },
  {
    "soru": "İnsülin pompası kullanıyorum. Beslenmemde nelere dikkat etmeliyim?",
    "cevap": "İnsülin pompası, beslenme konusunda esneklik sağlar. Ancak yine de karbonhidrat sayımını doğru bir şekilde yapmak ve pompa ayarlarını (bazal hız, karbonhidrat oranı) tükettiğiniz yiyeceklere göre düzenlemek çok önemlidir. Bu konuda diyabet ekibinizden eğitim almalısınız."
  },
  {
    "soru": "Diyabetim var ve sık sık seyahat ediyorum. Beslenmemi nasıl yönetebilirim?",
    "cevap": "Seyahat ederken öğün saatlerinizi mümkün olduğunca düzenli tutmaya çalışın. Yanınızda sağlıklı atıştırmalıklar (kuruyemiş, meyve gibi) bulundurun. Gittiğiniz yerdeki yiyecek seçeneklerini önceden araştırmak ve bol su içmek önemlidir."
  },
  {
    "soru": "Diyabetli bir birey için ara öğün yapmak zorunlu mudur?",
    "cevap": "Ara öğünler, kan şekerinin öğünler arasında aşırı düşmesini (hipoglisemi) önlemeye yardımcı olabilir. Özellikle insülin veya hipoglisemi riski olan ilaçlar kullanıyorsanız önemlidir. Ancak ara öğün ihtiyacı ve içeriği kişiye özeldir ve diyabet ekibinizle planlanmalıdır."
  },
  {
    "soru": "Glisemik indeks nedir ve diyetimde neden önemlidir?",
    "cevap": "Glisemik indeks (Gİ), karbonhidrat içeren gıdaların kan şekerini ne kadar hızlı yükselttiğini gösteren bir ölçüdür. Düşük Gİ'li gıdalar (tam tahıllar, baklagiller, çoğu sebze) kan şekerini daha yavaş ve dengeli bir şekilde yükselttiği için diyabet yönetiminde tercih edilir."
  },
  {
    "soru": "Diyabet hastaları meyve yiyebilir mi? Hangi meyveleri tercih etmeliyim?",
    "cevap": "Evet, diyabet hastaları porsiyon kontrolü yaparak meyve yiyebilir. Lif içeriği yüksek ve glisemik indeksi daha düşük olan meyveler (çilek, böğürtlen, elma, armut gibi) genellikle daha iyi seçeneklerdir. Meyve suları yerine meyvenin kendisini tüketmek daha sağlıklıdır."
  },
  {
    "soru": "Diyabetli bir birey için en sağlıklı pişirme yöntemleri nelerdir?",
    "cevap": "Haşlama, buğulama, ızgara ve fırında pişirme gibi yağ kullanımını en aza indiren yöntemler en sağlıklı seçeneklerdir. Kızartma gibi bol yağ gerektiren yöntemlerden kaçınılmalıdır."
  },
  {
    "soru": "Diyabetim var ve oruç tutmak istiyorum. Bu mümkün mü?",
    "cevap": "Diyabetli bireylerin oruç tutması riskli olabilir ve mutlaka doktor kontrolünde karar verilmelidir. Özellikle insülin veya hipoglisemiye neden olabilen ilaçlar kullananlar için risk daha yüksektir. Oruç tutulacaksa, sahur ve iftarda beslenme planı, ilaç ve insülin dozları doktor ve diyetisyen tarafından özel olarak ayarlanmalıdır."
  },
  {
    "soru": "Diyabetli bir bireyde 'glisemik değişkenlik' neden önemlidir ve beslenme ile nasıl azaltılabilir?",
    "cevap": "Glisemik değişkenlik, kan şekerindeki aşırı iniş ve çıkışları ifade eder ve diyabet komplikasyonları için bir risk faktörüdür. Düzenli öğün saatleri, porsiyon kontrolü, düşük glisemik indeksli ve lifli gıdaları tercih etmek ve basit şekerlerden kaçınmak glisemik değişkenliği azaltmaya yardımcı olur."
  },
  {
    "soru": "Diyabetik ayak ülserim var. Yara iyileşmesini hızlandırmak için beslenmemde nelere dikkat etmeliyim?",
    "cevap": "Yara iyileşmesi için yeterli protein, vitamin (özellikle C vitamini) ve mineral (özellikle çinko) alımı çok önemlidir. Ayrıca, kan şekeri kontrolünün sağlanması, yara iyileşmesi için kritik bir faktördür. Bu süreçte bir diyetisyenden destek almak faydalı olacaktır."
  },
  {
    "soru": "Sadece yaşam tarzı değişikliği ile Tip 2 diyabeti kontrol altına alabilir miyim?",
    "cevap": "Özellikle yeni tanı almış ve hafif seyreden Tip 2 diyabette, etkili bir diyet, düzenli egzersiz ve kilo kaybı ile kan şekeri kontrolü sağlanabilir ve ilaç ihtiyacı geciktirilebilir veya azaltılabilir. Ancak bu, hastalığın şiddetine ve bireysel faktörlere bağlıdır."
  },
  {
    "soru": "Diyabetli bir birey için 'sağlıksız' olarak kabul edilen bir yiyeceği çok canım çekerse ne yapmalıyım?",
    "cevap": "Diyabette 'yasak' yoktur, 'porsiyon kontrolü' ve 'denge' vardır. Canınızın çektiği bir yiyeceği çok küçük bir porsiyonda, sağlıklı bir öğünün parçası olarak ve nadiren tüketebilirsiniz. Bu tür bir tüketimden sonra kan şekerinizi takip etmek ve gerekirse bir sonraki öğünü dengelemek önemlidir."
  },
  {
    "soru": "Diyabetli bir bireyde uyku kalitesini artırmak için beslenme önerileri var mıdır?",
    "cevap": "Yatmadan önce kafeinli içeceklerden ve ağır, yağlı yiyeceklerden kaçınmak uyku kalitesini artırabilir. Gerekirse, kan şekerini gece boyunca dengede tutacak küçük ve sağlıklı bir gece ara öğünü (örneğin bir bardak süt veya bir avuç badem) düşünülebilir."
  },
  {
    "soru": "Diyabetli bir bireyde stresin kan şekeri üzerine etkisi nedir ve beslenme bu durumu nasıl yönetebilir?",
    "cevap": "Stres, kan şekerini yükselten hormonların (kortizol gibi) salgılanmasına neden olur. Stresli dönemlerde düzenli öğünler yemek, basit şekerlerden ve aşırı kafeinden kaçınmak ve magnezyumdan zengin gıdalar (yeşil yapraklı sebzeler, kuruyemişler) tüketmek kan şekeri yönetimini destekleyebilir."
  },
  {
    "soru": "Diyabet hastasıyım ve vegan veya vejetaryen bir diyet uygulamak istiyorum. Bu mümkün mü?",
    "cevap": "Evet, iyi planlandığı takdirde vegan veya vejetaryen diyetler diyabetli bireyler için de sağlıklı olabilir. Yeterli protein, demir, kalsiyum ve özellikle B12 vitamini alımına dikkat etmek çok önemlidir. Bu geçişi bir diyetisyen rehberliğinde yapmak en doğrusudur."
  },
  {
    "soru": "Diyabetli bireylerde su tüketiminin önemi nedir?",
    "cevap": "Yeterli su tüketimi, kan şekerinin düzenlenmesine yardımcı olur, böbrek fonksiyonlarını destekler ve dehidratasyonu önler. Özellikle kan şekeri yüksek olduğunda, vücut fazla şekeri idrarla atmaya çalıştığı için sıvı ihtiyacı artar."
  },
  {
    "soru": "Diyabetik bir bireyde öğün sonrası kan şekeri yüksekliğini (postprandiyal hiperglisemi) önlemek için ne yapabilirim?",
    "cevap": "Öğünlerinizde lifli gıdalara yer vermek, basit şekerlerden ve rafine karbonhidratlardan kaçınmak, porsiyon kontrolü yapmak ve öğünden sonra hafif tempolu bir yürüyüş gibi kısa süreli bir fiziksel aktivite yapmak, öğün sonrası kan şekeri yükselmesini kontrol altına almaya yardımcı olur."
  },
  {
    "soru": "Diyabetli bir bireyde 'metabolik sendrom' nedir ve beslenme ile ilişkisi nasıldır?",
    "cevap": "Metabolik sendrom; abdominal obezite (bel çevresi kalınlığı), yüksek kan basıncı, yüksek trigliserit, düşük HDL (iyi) kolesterol ve yüksek açlık kan şekerinden en az üçünün bir arada bulunduğu bir durumdur. Sağlıklı bir diyet ve düzenli egzersiz, metabolik sendromun tüm bileşenlerini iyileştirmede temel tedavi yaklaşımıdır."
  },
  {
    "soru": "Diyabetli bir bireyde kronik yorgunluk hissinin beslenme ile bir ilgisi olabilir mi?",
    "cevap": "Evet, kan şekerindeki aşırı dalgalanmalar (hem hiperglisemi hem de hipoglisemi), dehidratasyon ve B vitaminleri gibi bazı besin öğelerinin eksikliği yorgunluğa neden olabilir. Dengeli bir beslenme planı ve stabil kan şekeri seviyeleri, enerji seviyelerini artırmaya yardımcı olabilir."
  },
  {
    "soru": "Tip 1 diyabet tanısı aldım. İnsülin tedavisine başlarken beslenmem nasıl olmalı?",
    "cevap": "Tip 1 diyabette tedaviye başlarken tıbbi beslenme tedavisi ve egzersiz programı düzenli uygulanmalıdır. Başlangıç insülin dozu, genellikle 0.5 Ü/kg gibi bir değerle hesaplanır ve bu dozun yaklaşık %50'si bazal, kalanı ise öğünlere bölünerek bolus insülin olarak planlanır. Beslenme bu plana uygun olmalıdır."
  },
  {
    "soru": "Diyabetli bir bireyin evde kan şekeri takibi neden önemlidir?",
    "cevap": "Evde parmak ucu kan glukozu ölçümleri; öğünlere, fiziksel aktiviteye, ilaç değişimlerine ve insülin dozlarına glukoz yanıtlarını göstermesi açısından yararlıdır ve tedavinin doğru yönlendirilmesini sağlar."
  },
  {
    "soru": "İnsülin pompası kullanıyorum. Gece hipoglisemilerini önlemek için pompa ayarlarında ne gibi özellikler var?",
    "cevap": "Modern insülin pompaları, Sürekli Cilt altı Glukoz Takip Sistemleri (SCGTS) ile entegredir. Bu sistemler, kan şekeri düşmeden önce insülin gönderimini durduran 'Öngörücü Düşük Glukoz Askıya Alma' (PLGS) gibi özellikler sayesinde özellikle gece hipoglisemilerini önlemede etkilidir."
  },
  {
    "soru": "Diyabetim var ve ameliyat olacağım. Ameliyat sabahı açlık kan şekerim 150 mg/dl. Bu durumda ameliyat olabilir miyim?",
    "cevap": "Evet, ameliyat sabahı başlangıç kan şekerinin 70 ila 250 mg/dl arasında olması durumunda tipik perioperatif bakım devam edebilir. Önerilen optimal aralık genellikle 80-180 mg/dl'dir."
  },
  {
    "soru": "Ameliyat sırasında kan şekerimi kontrol etmek için hangi yöntemler kullanılır?",
    "cevap": "Uzun veya majör cerrahilerde, değişken emilim riski nedeniyle subkutan (cilt altı) insülinler tercih edilmez. Genellikle, daha hassas kontrol sağlayan intravenöz (damar içi) insülin infüzyonları (GIK solüsyonu veya ayrı yol insülin infüzyonu) kullanılır."
  },
  {
    "soru": "İnsülin iğnesi yaptığım yerde şişlik ve sertlik (lipohipertrofi) oluştu. Bu durum beslenmemi ve kan şekerimi nasıl etkiler?",
    "cevap": "Lipohipertrofi, insülinin o bölgeden emilimini bozar ve düzensizleştirir. Bu durum, kan şekerinizde beklenmedik dalgalanmalara (hipoglisemi veya hiperglisemi) neden olabilir. Bu nedenle enjeksiyon bölgelerinin düzenli olarak değiştirilmesi kritik öneme sahiptir."
  },
  {
    "soru": "Diyabetik bir bireyde glisemik hedeflere ulaşmada uyku düzeninin rolü nedir?",
    "cevap": "Uyku düzeni, diyabet yönetiminin merkezi bir bileşenidir. Hem yetersiz (<6 saat) hem de aşırı (>9 saat) uykunun, prediyabetten diyabete ilerleme dahil olmak üzere Tip 2 diyabet riskini artırdığı gösterilmiştir."
  },
  {
    "soru": "Sık sık idrar yolu enfeksiyonu geçiriyorum, diyabetimle bir ilgisi olabilir mi?",
    "cevap": "Evet, diyabetli bireylerde, özellikle hiperglisemi durumunda, üropatojenik E. coli gibi bakterilerin mesane ürotelyumuna bağlanması artar. Bu durum, alt idrar yolu enfeksiyonlarına karşı duyarlılığı artırır."
  },
  {
    "soru": "Kırılgan ve yaşlı bir diyabet hastasıyım. Hangi diyabet ilaçları benim için daha güvenli olabilir?",
    "cevap": "Hipoglisemi riski yüksek olan kırılgan yaşlı hastalarda, kontrendikasyon yoksa DPP-4 inhibitörleri gibi hipoglisemi riski daha düşük olan farmakolojik ajanlar ilk sıralarda tercih edilmelidir. Sülfonilüreler ise hipoglisemi ve düşme riski nedeniyle genellikle tercih edilmez."
  },
  {
    "soru": "Orta derecede böbrek yetmezliğim (eGFR 30-45 ml/dk) var ve metformin kullanıyorum. Doz ayarı gerekir mi?",
    "cevap": "Evet, eGFR 30-45 ml/dk aralığında olan olgularda, eğer hasta zaten metformin kullanıyorsa dozun %50 oranında azaltılması ve yakın takip önerilmektedir. Bu aralıkta yeni metformin tedavisine başlanması ise önerilmez."
  },
  {
    "soru": "Karaciğer sirozum var. Hangi diyabet ilacı benim için en güvenlisidir?",
    "cevap": "Orta-ileri düzeyde karaciğer fonksiyon bozukluğu olan sirozlu diyabetik hastalarda en etkili ve güvenilir tedavi yöntemi insülindir ve ilk seçenek olarak tercih edilmelidir."
  },
  {
    "soru": "Yoğun bakımda yatan bir diyabet hastasının beslenmesi nasıl planlanır?",
    "cevap": "Yoğun bakımda beslenme, enteral (sindirim sistemi yoluyla) veya parenteral (damar yoluyla) olabilir. İnsülin rejimleri, bu beslenme programlarına ve karbonhidrat alımına göre dikkatlice ayarlanmalıdır. Aşırı glukoz dalgalanmalarını önlemek için makro besinler yakından izlenmelidir."
  },
  {
    "soru": "Hastanede yatarken diyabet ilaçlarıma devam etmeli miyim?",
    "cevap": "Hastaneye yatış gerektiren ciddi hastalıklarda, oral antidiyabetik ilaçlar genellikle kesilir ve hiperglisemi yönetimi için daha esnek ve etkili bir yöntem olan insülin tedavisine geçilir. Durumu stabil olan hastalarda, kontrendikasyon yoksa evdeki tedaviye dikkatle devam edilebilir."
  },
  {
    "soru": "Glukokortikoid (kortizon) tedavisi alıyorum ve kan şekerim yükseldi. Bu normal mi?",
    "cevap": "Evet, glukokortikoid tedavisi alan hastalarda hiperglisemi sık görülür. Diyabet öyküsü olmayan bireylerde bile bu oran %20-50 arasında değişebilir. Bu durumda genellikle kan şekeri kontrolü için NPH insülin veya diğer insülin rejimleri kullanılır."
  },
  {
    "soru": "Tip 1 diyabetli bir gebeyim. Hamilelik boyunca insülin ihtiyacım nasıl değişir?",
    "cevap": "Gebeliğin erken dönemlerinde (ilk trimester) insülin ihtiyacı genellikle daha azdır. Ancak 24. haftadan itibaren plasental hormonların etkisiyle insülin direnci artar ve insülin ihtiyacı doğuma yakın döneme kadar kademeli olarak yükselir."
  },
  {
    "soru": "Diyabetik bir bireyim, ayaklarımda his kaybı var. Hangi egzersizlerden kaçınmalıyım?",
    "cevap": "Nöropati sonucu duyu kaybı olan bireylerde, ayaklara aşırı yük bindiren veya travma riski taşıyan (koşu, zıplama gibi) yüksek etkili egzersizlerden kaçınılmalıdır. Yüzme, bisiklet gibi daha az riskli aktiviteler tercih edilebilir."
  },
  {
    "soru": "Aşırı zayıfım ama Tip 2 diyabet tanısı aldım. Bu mümkün mü?",
    "cevap": "Tip 2 diyabet çoğunlukla fazla kilo/obezite ile ilişkilidir ancak her zaman değil. Genetik yatkınlık ve diğer faktörler de rol oynar. Ayrıca, yetişkin yaşta ortaya çıkan ve zayıf bireylerde görülen diyabetin LADA (Yetişkinlerde Latent Otoimmün Diyabet) gibi farklı bir alt tip olabileceği de akılda tutulmalıdır."
  },
  {
    "soru": "Yemeklerden sonra kan şekerimin çok yükselmemesi için ne tür karbonhidratlar seçmeliyim?",
    "cevap": "Kan şekerinin yavaş yükselmesini sağlayan kompleks ve lifli karbonhidratları tercih etmelisiniz. Bunlar arasında tam tahıllı ekmek, bulgur, yulaf, esmer pirinç, baklagiller ve nişastalı olmayan sebzeler bulunur. Beyaz ekmek, beyaz pirinç, şekerli ürünler gibi basit karbonhidratlardan kaçınılmalıdır."
  },
  {
    "soru": "İnsülin direncim var. Egzersiz bu durumu nasıl iyileştirir?",
    "cevap": "Egzersiz, kasların kan dolaşımından glukozu daha verimli bir şekilde almasını ve kullanmasını sağlar. Bu, vücudun insüline olan duyarlılığını artırır ve insülin direncini kırmaya yardımcı olur. Hem aerobik hem de direnç egzersizleri bu konuda etkilidir."
  },
  {
    "soru": "Besin etiketlerini okurken nelere dikkat etmeliyim?",
    "cevap": "Besin etiketlerinde 'porsiyon başına' verilen değerlere dikkat edin. 'Toplam Karbonhidrat', 'Diyet Lifi' ve 'Şekerler' (özellikle 'Eklenmiş Şeker') kısımlarını kontrol edin. Lif, karbonhidratın emilimini yavaşlattığı için yüksek lifli ürünler genellikle daha iyi bir seçimdir. Ayrıca doymuş ve trans yağ miktarına da bakmalısınız."
  }
]
